In [2]:

#  install python locally
#  -	navigate to C:\Program Files\Python311\Scripts via File Explorer
#  -	replace the address with cmd to open Command Prompt into that directory
#  -	pip install jupyter
#  -	install all python libraries needed
#    e.g.
#      pip install pandas
#      pip install numpy
#      pip install scikit-learn
#      pip install matplotlib
#      pip install seaborn
#  -	from any folder, open cmd, then type jupyter notebook to open it
#  -	create a new folder (itâ€™ll be in the Python installation), then New > Python 3
#  -	add the folder to Quick Access


# =================================================

import numpy as np
import pandas as pd

from pandas import Series, DataFrame

In [10]:
# label index vs integer index

series_obj = Series(np.arange(8), index=['row 1','row 2','row 3','row 4','row 5','row 6','row 7','row 8'])
series_obj

row 1    0
row 2    1
row 3    2
row 4    3
row 5    4
row 6    5
row 7    6
row 8    7
dtype: int32

In [8]:
series_obj['row 7']

6

In [9]:
series_obj[[0,7]]

row 1    0
row 8    7
dtype: int32

In [19]:
# create dataframe object
# note: passing in a seed e.g. 2, makes it return the same "random" results each time
np.random.seed(25)
DF_obj = DataFrame(np.random.rand(36).reshape((6,6)),
                   index=['row 1','row 2','row 3','row 4','row 5','row 6'],
                   columns=['column 1','column 2','column 3','column 4','column 5','column 6'])
DF_obj

       column 1  column 2  column 3  column 4  column 5  column 6
row 1  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
row 2  0.684969  0.437611  0.556229  0.367080  0.402366  0.113041
row 3  0.447031  0.585445  0.161985  0.520719  0.326051  0.699186
row 4  0.366395  0.836375  0.481343  0.516502  0.383048  0.997541
row 5  0.514244  0.559053  0.034450  0.719930  0.421004  0.436935
row 6  0.281701  0.900274  0.669612  0.456069  0.289804  0.525819

In [20]:
# .iloc indexer
DF_obj.loc[['row 2', 'row 5'], ['column 5','column 2']]

       column 5  column 2
row 2  0.402366  0.437611
row 5  0.421004  0.559053

In [24]:
# slicing via 2 index values separated by colon : e.g. firstvalue : lastvalue
# indexer gets everything in between

# example retrieve all data between rows 3 and 7
DF_obj['row 3':'row 7']

       column 1  column 2  column 3  column 4  column 5  column 6
row 3  0.447031  0.585445  0.161985  0.520719  0.326051  0.699186
row 4  0.366395  0.836375  0.481343  0.516502  0.383048  0.997541
row 5  0.514244  0.559053  0.034450  0.719930  0.421004  0.436935
row 6  0.281701  0.900274  0.669612  0.456069  0.289804  0.525819

In [25]:
# compare with scalars
# scalar: refers to a single numerical value
# use comparison operators to get records based on operator

DF_obj < .2

       column 1  column 2  column 3  column 4  column 5  column 6
row 1     False     False     False      True     False      True
row 2     False     False     False     False     False      True
row 3     False     False      True     False     False     False
row 4     False     False     False     False     False     False
row 5     False     False      True     False     False     False
row 6     False     False     False     False     False     False

In [27]:
# filter with scalers

DF_obj[DF_obj > 0.9]

       column 1  column 2  column 3  column 4  column 5  column 6
row 1       NaN       NaN       NaN       NaN       NaN       NaN
row 2       NaN       NaN       NaN       NaN       NaN       NaN
row 3       NaN       NaN       NaN       NaN       NaN       NaN
row 4       NaN       NaN       NaN       NaN       NaN  0.997541
row 5       NaN       NaN       NaN       NaN       NaN       NaN
row 6       NaN  0.900274       NaN       NaN       NaN       NaN

In [43]:
# set value with scalars
# select all records with specified label index, then set their values to a scalar
# e.g. set value on row 5 to the value of 420

series_obj['row 5'] = 420
series_obj

row 1      8
row 2      1
row 3      2
row 4      3
row 5    420
row 6      5
row 7      6
row 8      7
dtype: int32

In [44]:
# handling missing values
# better to use approximation, rather than drop fields wioth missing values altogether

missing = np.nan

series_obj = Series(['row 1', 'row 2', missing, 'row 4', 'row 5', 'row 6', missing, 'row 8'])
series_obj

0    row 1
1    row 2
2      NaN
3    row 4
4    row 5
5    row 6
6      NaN
7    row 8
dtype: object